let img;
// let tileSize = 50;  // 조각의 크기
let pieces = [];    // 조각의 좌표를 저장할 배열

function preload() {
  img = loadImage('girl.png');  // 사진 파일을 로드
}

function setup() {
  createCanvas(img.width, img.height); // 캔버스 크기 설정 (사진 크기에 맞춤)

// 삼각형의 세좌표와 색 (x1, y1, x2, y2, x3, y3, color)
pieces.push([582, 150, 670, 121, 676, 164, 'rgba(167, 183, 196, 255)']); //1
pieces.push([582, 150, 591, 210, 676, 164, 'rgba(167, 183, 196, 255)']); //3
pieces.push([653, 230, 591, 210, 676, 164, 'rgba(167, 183, 196, 255)']); //5


pieces.push([670, 121, 737, 129, 676, 164, 'rgba(115, 149, 187, 255)']); //2
pieces.push([676, 164, 757, 229, 737, 129, 'rgba(115, 149, 187, 255)']); //4
pieces.push([653, 230, 676, 164, 757, 229, 'rgba(115, 149, 187, 255)']); //6
pieces.push([737, 129, 757, 229, 824, 213, 'rgba(115, 149, 187, 255)']); //7
pieces.push([818, 268, 757, 229, 824, 213, 'rgba(115, 149, 187, 255)']); //15
pieces.push([818, 268, 757, 229, 754, 268, 'rgba(115, 149, 187, 255)']); //14
pieces.push([653, 230, 757, 229, 754, 268, 'rgba(115, 149, 187, 255)']); //13
pieces.push([653, 230, 695, 271, 754, 268, 'rgba(115, 149, 187, 255)']); //12

pieces.push([782, 326, 695, 271, 754, 268, 'rgba(26, 55, 95, 255)']); //20
pieces.push([782, 326, 818, 268, 754, 268, 'rgba(26, 55, 95, 255)']); //21
pieces.push([782, 326, 818, 268, 845, 316, 'rgba(26, 55, 95, 255)']); //25
pieces.push([782, 326, 695, 271, 706, 332, 'rgba(26, 55, 95, 255)']); //19
pieces.push([782, 326, 751, 376, 706, 332, 'rgba(26, 55, 95, 255)']); //24

pieces.push([591, 210, 546, 256, 607, 272, 'rgba(142, 170, 191, 255)']); //8
pieces.push([591, 210, 653, 230, 607, 272, 'rgba(142, 170, 191, 255)']); //9
pieces.push([670, 308, 653, 230, 607, 272, 'rgba(142, 170, 191, 255)']); //10

//살색 
pieces.push([670, 308, 616, 335, 607, 272, 'rgba(230, 202, 188, 255)']); //18
pieces.push([567, 315, 616, 335, 607, 272, 'rgba(230, 202, 188, 255)']); //17
pieces.push([567, 315, 546, 256, 607, 272, 'rgba(230, 202, 188, 255)']); //16
pieces.push([567, 315, 616, 335, 570, 344, 'rgba(230, 202, 188, 255)']); //22
pieces.push([670, 308, 706, 332, 646, 356, 'rgba(230, 202, 188, 255)']); //23

//사각형인 거 11
}
function draw() {
  image(img, 0, 0);  // 배경 이미지를 그림

  for (let piece of pieces) {
    let x1 = piece[0];
    let y1 = piece[1];
    let x2 = piece[2];
    let y2 = piece[3];
    let x3 = piece[4];
    let y3 = piece[5];
    let color = piece[6];

    fill(color);
    noStroke(); //조각들의 테두리 없애기 위함
    beginShape();
    vertex(x1, y1);
    vertex(x2, y2);
    vertex(x3, y3);
    endShape(CLOSE); // 삼각형 그리기
  }
  
}
